In [1]:
import numpy as np

In [2]:
np.linspace(0,1,10)

array([0.        , 0.11111111, 0.22222222, 0.33333333, 0.44444444,
       0.55555556, 0.66666667, 0.77777778, 0.88888889, 1.        ])

In [3]:
np.linspace(0,1,10).size

10

In [4]:
np.linspace?

In [5]:
np.linspace(0,1)

array([0.        , 0.02040816, 0.04081633, 0.06122449, 0.08163265,
       0.10204082, 0.12244898, 0.14285714, 0.16326531, 0.18367347,
       0.20408163, 0.2244898 , 0.24489796, 0.26530612, 0.28571429,
       0.30612245, 0.32653061, 0.34693878, 0.36734694, 0.3877551 ,
       0.40816327, 0.42857143, 0.44897959, 0.46938776, 0.48979592,
       0.51020408, 0.53061224, 0.55102041, 0.57142857, 0.59183673,
       0.6122449 , 0.63265306, 0.65306122, 0.67346939, 0.69387755,
       0.71428571, 0.73469388, 0.75510204, 0.7755102 , 0.79591837,
       0.81632653, 0.83673469, 0.85714286, 0.87755102, 0.89795918,
       0.91836735, 0.93877551, 0.95918367, 0.97959184, 1.        ])

In [6]:
np.linspace(0,1).size

50

In [7]:
import pandas as pd
df = pd.DataFrame({"Course": ['IST5001','IST5001','IST5001','IST5001'],
"Student": ['Jack','Kim','Tony','David'],
"Score": [80, 90, 85, 70]})

In [10]:
x = df['Student']
print(type(x))
x

<class 'pandas.core.series.Series'>

0     Jack
1      Kim
2     Tony
3    David
Name: Student, dtype: object

In [11]:
import pandas as pd
df = pd.DataFrame({"Course": ['IST5001','IST5001','IST5001','IST5001'],
"Student": ['Jack','Kim','Tony','David'],
"Score": [80, 90, 85, 70]})
y = df['Score'] >= 85
y

0    False
1     True
2     True
3    False
Name: Score, dtype: bool

In [12]:
df[y]

    Course Student  Score
1  IST5001     Kim     90
2  IST5001    Tony     85

In [13]:
df

    Course Student  Score
0  IST5001    Jack     80
1  IST5001     Kim     90
2  IST5001    Tony     85
3  IST5001   David     70

In [14]:
df['Student'][y]

1     Kim
2    Tony
Name: Student, dtype: object

In [15]:
df[['Student']][y]

  Student
1     Kim
2    Tony

In [16]:
df

    Course Student  Score
0  IST5001    Jack     80
1  IST5001     Kim     90
2  IST5001    Tony     85
3  IST5001   David     70

In [18]:
df.iloc[2,2]

85

In [22]:
df[['Course','Score']].groupby('Course').mean()

         Score
Course
IST5001  81.25

In [25]:
y = 0
i = 0
while i < 20:
    i = i + 1
    if i == 10 or i == 9:
        continue
    y = y + i
print(y)

191

In [29]:
df = pd.DataFrame({"Course": ['IST5001','IST5001','IST5420','IST5420'],
"Student": ['Jack','Kim','Tony','David'],
"Score": [80, 90, 85, 70]})
df

    Course Student  Score
0  IST5001    Jack     80
1  IST5001     Kim     90
2  IST5420    Tony     85
3  IST5420   David     70

In [30]:
df.Course.str.extract("(\d{1,3})", expand = True)

     0
0  500
1  500
2  542
3  542

In [31]:
pd.concat([df.loc[:,'Score':'Student'],
df.Course.str.get_dummies()],
axis = 1)

   IST5001  IST5420
0        1        0
1        1        0
2        0        1
3        0        1

In [32]:
df.loc?

In [33]:
df.loc[:,'Score':'Student']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [35]:
pd.concat([df.loc[:],
df.Course.str.get_dummies()],
axis = 1)

    Course Student  Score  IST5001  IST5420
0  IST5001    Jack     80        1        0
1  IST5001     Kim     90        1        0
2  IST5420    Tony     85        0        1
3  IST5420   David     70        0        1

In [36]:
df.Course.str.get_dummies()

   IST5001  IST5420
0        1        0
1        1        0
2        0        1
3        0        1

In [37]:
df.Course

0    IST5001
1    IST5001
2    IST5420
3    IST5420
Name: Course, dtype: object

In [43]:
df.Course.str.get_dummies?

In [44]:
pd.concat([df,
df.Course.str.get_dummies()],
axis = 1)

    Course Student  Score  IST5001  IST5420
0  IST5001    Jack     80        1        0
1  IST5001     Kim     90        1        0
2  IST5420    Tony     85        0        1
3  IST5420   David     70        0        1

In [45]:
pd.concat([df.loc['Score':'Student'],
df.Course.str.get_dummies()],
axis = 1)

  Course Student  Score  IST5001  IST5420
0    NaN     NaN    NaN        1        0
1    NaN     NaN    NaN        1        0
2    NaN     NaN    NaN        0        1
3    NaN     NaN    NaN        0        1

In [46]:
df.loc['Score':'Student']

Empty DataFrame
Columns: [Course, Student, Score]
Index: []

In [48]:
pd.concat([df.loc['Score':'Student'],
df.Course.str.get_dummies()])

  Course Student  Score  IST5001  IST5420
0    NaN     NaN    NaN      1.0      0.0
1    NaN     NaN    NaN      1.0      0.0
2    NaN     NaN    NaN      0.0      1.0
3    NaN     NaN    NaN      0.0      1.0

In [49]:
pd.concat([df.loc['Score':'Student'],
df.Course.str.get_dummies()],
axis = 0)

  Course Student  Score  IST5001  IST5420
0    NaN     NaN    NaN      1.0      0.0
1    NaN     NaN    NaN      1.0      0.0
2    NaN     NaN    NaN      0.0      1.0
3    NaN     NaN    NaN      0.0      1.0

In [50]:
pd.concat([df.loc['Score':'Student'],
df.Course.str.get_dummies()],
axis = 1)

  Course Student  Score  IST5001  IST5420
0    NaN     NaN    NaN        1        0
1    NaN     NaN    NaN        1        0
2    NaN     NaN    NaN        0        1
3    NaN     NaN    NaN        0        1

In [51]:
pd.concat([df.loc[:,'Score':'Student'],
df.Course.str.get_dummies()],
axis = 1)

   IST5001  IST5420
0        1        0
1        1        0
2        0        1
3        0        1

In [52]:
df.Course.str.get_dummies()

   IST5001  IST5420
0        1        0
1        1        0
2        0        1
3        0        1

In [55]:
df.loc[['Score','Student']]

KeyError: "None of [Index(['Score', 'Student'], dtype='object')] are in the [index]"